const Accessibility = () => {
  return (
    <div
      className="mx-auto pt-10 px-10 bg-gray-100 min-h-screen flex flex-col items-center p-6"
      dir="rtl"
    >
      <div className="max-w-5xl w-full bg-white shadow-lg rounded-lg p-8">
        <h2 className="text-4xl font-bold text-orange-500 mb-4 text-center pb-10">
          הצהרת נגישות לאתר Job Seek
        </h2>
        <ul className="list-decimal px-10 space-y-5 text-right">
          <li>
            הקדמה אתר Job Seek שואף להבטיח גישה נוחה ומלאה לשירותים המוצעים בו
            עבור כל המשתמשים, כולל אנשים עם מוגבלויות. אנו מחויבים לספק חוויית
            משתמש טובה וידידותית לכל.
          </li>
          <li>
            עקרונות הנגישות א. האתר עוקב אחר ההנחיות המוצגות על ידי התקן הישראלי
            לנגישות (ת"י 5568) וסטנדרטים בינלאומיים, כגון WCAG 2.1. ב. אנו
            פועלים להבטיח שהאתר יהיה נגיש לשימוש על ידי כל המשתמשים, לרבות אנשים
            עם מוגבלויות פיזיות, חושיות, קוגניטיביות ורגשיות.
          </li>
          <li>
            אמצעים לנגישות א. הטקסט באתר מותאם לקריאה נוחה וכולל אפשרויות להגדלת
            גודל הטקסט. ב. האתר כולל תיאורים חלופיים לתמונות וגרפיקה, כך
            שמשתמשים עם לקויות ראייה יוכלו להבין את התוכן. ג. הניווט באתר הוגדר
            כך שיהיה קל לשימוש באמצעות מקלדת בלבד, מבלי להזדקק לעכבר. ד. הצבעים
            והניגודים באתר נבחרו כדי להבטיח נראות ברורה עבור משתמשים עם לקויות
            ראייה.
          </li>
          <li>
            משוב ושיפורים א. אנו מחויבים לשיפור מתמיד של נגישות האתר. אם נתקלת
            בקושי או יש לך הצעות לשיפור, נשמח לשמוע ממך. ב. ניתן לשלוח משוב או
            פניות בנושא נגישות דרך פרטי הקשר המופיעים באתר.
          </li>
          <li>
            זמינות תכנים נגישים א. אנו פועלים להבטיח שתכני האתר יהיו נגישים ככל
            האפשר. אם תכנים מסוימים אינם נגישים, אנו נעשה מאמצים לתקן זאת בהקדם
            האפשרי.
          </li>
          <li>
            הצהרה על נגישות א. הצהרה זו תעודכן מעת לעת, בהתאם לשיפורים שנבצע
            באתר. אנו ממליצים לבדוק את ההצהרה מדי פעם כדי להתעדכן.
          </li>
          <li>
            סמכות שיפוט א. הצהרת הנגישות הזו כפופה לחוקי מדינת ישראל וכל מחלוקות
            יידונו בבית המשפט המוסמך בתל אביב.
          </li>
        </ul>
      </div>
    </div>
  );
};

export default Accessibility;
