const Privacy = () => {
  return (
    <div
      className="mx-auto pt-10 px-10 bg-gray-100 min-h-screen flex flex-col items-center p-6"
      dir="rtl"
    >
      <div className="max-w-5xl w-full bg-white shadow-lg rounded-lg p-8">
        <h2 className="text-4xl font-bold text-orange-500 mb-4 text-center pb-10">
          מדיניות פרטיות לאתר Job Seek
        </h2>
        <ul className="list-decimal px-10 space-y-5 text-right">
          <li>
            הקדמה מדיניות פרטיות זו מסבירה כיצד אתר Job Seek (להלן: "האתר")
            אוסף, משתמש ושומר על המידע האישי שלך. השימוש באתר מהווה הסכמה לתנאים
            המפורטים במדיניות זו. אם אינך מסכים לתנאים הללו, אנא אל תשתמש באתר.
          </li>
          <li>
            מידע שנאסף א. המידע האישי שנאסף כולל, אך לא מוגבל ל: שם כתובת דוא"ל
            מספר טלפון קורות חיים ומידע מקצועי נתוני התחברות (שם משתמש, סיסמה)
          </li>
          <li>
            המידע שאינו אישי עשוי לכלול נתונים על השימוש שלך באתר, כמו דפים
            שנצפו וזמן השימוש
          </li>
          <li>
            אופן השימוש במידע א. המידע האישי שלך עשוי לשמש עבור: ניהול חשבונך
            באתר מתן שירותים מותאמים אישית תקשורת עם משתמשים בנוגע לעדכונים
            ושירותים ניתוח שימוש באתר ושיפור השירותים
          </li>
          <li>
            שיתוף המידע א. האתר לא יחשוף את המידע האישי שלך לצדדים שלישיים, אלא
            אם כן: קיבלת הסכמה מפורשת לכך. נדרש לעשות זאת לפי חוק או על פי צו
            בית משפט. יש צורך להגן על זכויות האתר, המשתמשים או אחרים.
          </li>
          <li>
            שמירת המידע א. המידע האישי שלך יישמר כל עוד הוא נדרש למטרות המפורטות
            במדיניות זו. ב. לאחר שייגמר הצורך במידע, הוא יימחק או יתוקן כך שלא
            ניתן יהיה לזהות אותך.
          </li>
          <li>
            אבטחת מידע א. האתר נוקט אמצעי אבטחה סבירים כדי להגן על המידע האישי
            שלך מפני גישה לא מורשית, אובדן או פגיעה. ב. עם זאת, אין אנו יכולים
            להבטיח אבטחה מוחלטת של המידע.
          </li>
          <li>
            שימוש בעוגיות (Cookies) א. האתר משתמש בעוגיות לשיפור חוויית השימוש.
            עוגיות הן קבצים קטנים המוצבים במכשיר שלך. ב. המשתמש יכול לבחור לא
            לאפשר עוגיות בדפדפן שלו, אך ייתכן שחלק מהשירותים לא יפעלו כראוי.
          </li>
          <li>
            זכויות המשתמש א. למשתמש יש את הזכות: לגשת למידע האישי שלו ולבקש
            תיקון או מחיקה שלו. לבקש להפסיק לקבל הודעות שיווקיות בכל עת.
          </li>
          <li>
            שינויים במדיניות א. האתר שומר לעצמו את הזכות לשנות את מדיניות פרטיות
            זו מעת לעת. ב. שינויים ייכנסו לתוקף מיד עם פרסומם באתר.
          </li>
          <li>
            יצירת קשר א. אם יש לך שאלות או בקשות בנוגע למדיניות פרטיות זו, תוכל
            לפנות אלינו דרך פרטי הקשר המופיעים באתר.
          </li>
          <li>
            סמכות שיפוט א. מדיניות פרטיות זו כפופה לחוקי מדינת ישראל וכל מחלוקות
            יידונו בבית המשפט המוסמך בתל אביב.
          </li>
        </ul>
      </div>
    </div>
  );
};

export default Privacy;
