const UserAgreement = () => {
  return (
    <div
      className="mx-auto pt-10 px-10 bg-gray-100 min-h-screen flex flex-col items-center p-6"
      dir="rtl"
    >
      <div className="max-w-5xl w-full bg-white shadow-lg rounded-lg p-8">
        <h2 className="text-4xl font-bold text-orange-500 mb-4 text-center pb-10">
          תנאי שימוש לאתר JobSeek
        </h2>
        <ul className="list-decimal px-10 space-y-5 text-right">
          <li>
            הקדמה ברוכים הבאים לאתר Job Seek. תנאי השימוש המפורטים להלן (להלן:
            "תנאי השימוש") מסדירים את השימוש שלך באתר ובשירותים המוצעים בו.
            השימוש באתר מהווה הסכמה לתנאים הללו. אם אינך מסכים לתנאים אלו, אנא
            אל תשתמש באתר.
          </li>
          <li>
            הגדרות א. "האתר" – אתר האינטרנט Job Seek. ב. "שירותים" – כל
            השירותים, הכלים והמידע המוצעים באתר. ג. "משתמש" – כל אדם או גורם
            משפטי המתחבר לאתר ומבצע בו פעולות.
          </li>
          <li>
            זכויות שימוש א. השימוש באתר הוא אישי ואינו ניתן להעברה. ב. המשתמש
            מתחייב לא לעשות שימוש לרעה באתר ולא לפגוע בזכויות של אחרים.
          </li>
          <li>
            רישום א. בכדי להשתמש בשירותים מסוימים באתר, ייתכן שתצטרך להירשם
            וליצור חשבון משתמש. ב. המשתמש מתחייב לספק מידע נכון ומדויק בעת
            הרישום ולשמור על סודיות הפרטים שלו.
          </li>
          <li>
            אבטחת מידע א. המשתמש אחראי לשמור על סודיות סיסמתו. ב. במקרה של פרצת
            אבטחה, המשתמש מתבקש לדווח מיד לצוות האתר.
          </li>
          <li>
            שימוש במידע א. המידע שנמסר על ידי המשתמש יישמר בהתאם למדיניות
            הפרטיות של האתר. ב. המשתמש מסכים לקבל עדכונים ותקשורת שיווקית מהאתר,
            אלא אם כן ביטל את ההסכמה.
          </li>
          <li>
            אחריות האתר א. האתר אינו אחראי לכל נזק שייגרם למשתמש כתוצאה משימוש
            בשירותים או מהמידע המופיע באתר. ב. האתר שואף לספק מידע מדויק, אך
            אינו יכול להתחייב לכך.
          </li>
          <li>
            זכויות קניין רוחני א. כל הזכויות באתר, לרבות תוכן, עיצובים, סמלילים,
            תמונות וכדומה, מוגנים בזכויות יוצרים ובזכויות קניין רוחני אחרות. ב.
            אין להעתיק, לשכפל או להפיץ את התוכן ללא אישור מראש ובכתב מהאתר.
          </li>
          <li>
            תוכן משתמשים א. המשתמש מתיר לאתר להשתמש בתוכן שהוא מפרסם באתר. ב.
            המשתמש אחראי לתוכן שהוא מפרסם ואינו יכול להעלות תוכן לא חוקי או
            פוגע.
          </li>
          <li>
            שינויים בתנאים א. האתר שומר לעצמו את הזכות לשנות את תנאי השימוש מעת
            לעת. ב. השינויים ייכנסו לתוקף מיד עם פרסומם באתר.
          </li>
          <li>
            סיום שימוש א. האתר שומר לעצמו את הזכות להפסיק את השירותים למשתמש בכל
            עת, לפי שיקול דעתו הבלעדי. ב. במקרה של הפרת תנאי השימוש, האתר רשאי
            לחסום את הגישה של המשתמש.
          </li>
          <li>
            מדיניות פרטיות א. השימוש במידע האישי של המשתמש ייעשה בהתאם למדיניות
            הפרטיות של האתר. ב. מדיניות זו מפרטת כיצד האתר אוסף, משתמש ושומר על
            המידע האישי שלך.
          </li>
          <li>
            תשלומים א. חלק מהשירותים עשויים להיות כרוכים בתשלום. ב. כל התשלומים
            יבוצעו דרך מערכת תשלומים מאובטחת.
          </li>
          <li>
            הודעות א. האתר רשאי לשלוח למשתמש הודעות בנוגע לשירותים, עדכונים
            ושיווק. ב. המשתמש יכול לבטל את המנוי להודעות שיווקיות בכל עת.
          </li>
          <li>
            קישורים לאתרים חיצוניים א. האתר עשוי להכיל קישורים לאתרים חיצוניים.
            האתר אינו אחראי לתוכן או למדיניות הפרטיות של אתרים אלו.
          </li>
          <li>
            הגבלת אחריות א. האתר לא יהיה אחראי לכל נזק ישיר, עקיף, מיוחד או
            תוצאתי שייגרם למשתמש כתוצאה מהשימוש באתר.
          </li>
          <li>
            שיפוט א. כל מחלוקות הנוגעות לתנאי השימוש או לשירותים יידונו בבית
            המשפט המוסמך בתל אביב, ישראל.
          </li>
          <li>
            גישה לאתר א. האתר שומר לעצמו את הזכות להגביל את הגישה לאתר בכל עת.
          </li>
          <li>
            שימוש בסקרי דעת קהל א. המשתמש מסכים להשתתף בסקרים ובחינות דעת
            המוצעים באתר.
          </li>
          <li>
            פרסומות א. האתר עשוי לכלול פרסומות של צדדים שלישיים. האתר אינו אחראי
            לתוכן הפרסומות.
          </li>
          <li>
            שימוש בעוגיות (Cookies) א. האתר עושה שימוש בעוגיות כדי לשפר את
            חוויית השימוש. המשתמש יכול לבחור לא לאפשר עוגיות בדפדפן שלו.
          </li>
          <li>
            הגנה על מידע א. האתר מקדיש מאמצים לשמור על פרטיות המידע של המשתמשים,
            אך אינו יכול להתחייב על אבטחה מוחלטת.
          </li>
          <li>
            פרטי יצירת קשר א. למשתמש יש אפשרות לפנות לצוות האתר בכל שאלה או בעיה
            דרך פרטי הקשר המופיעים באתר.
          </li>
          <li>
            הפסקת שירותים א. האתר שומר לעצמו את הזכות להפסיק את השירותים המוצעים
            בכל עת, עם או בלי הודעה מראש.
          </li>
          <li>סמכות חוקית א. תנאי השימוש כפופים לחוקי מדינת ישראל.</li>
          <li>
            הגדרות נוספות א. כל מונח שלא הוגדר כאן יפורש על פי משמעותו המקובלת.
          </li>
          <li>
            שימוש במידע פרסונלי א. האתר עשוי לאסוף מידע על העדפות המשתמש כדי
            לשפר את השירותים המוצעים.
          </li>
          <li>
            תוכן פוגעני א. האתר שומר לעצמו את הזכות להסיר תוכן פוגעני או לא
            חוקי.
          </li>
          <li>
            פיצוי א. המשתמש מתחייב לפצות את האתר בגין כל נזק או הפסד שייגרמו לו
            כתוצאה מהפרת תנאי השימוש.
          </li>
          <li>
            מדיניות מחירים א. האתר שומר לעצמו את הזכות לשנות מחירים עבור
            השירותים המוצעים, עם או בלי הודעה מראש.
          </li>
        </ul>
      </div>
    </div>
  );
};

export default UserAgreement;
